import Image from 'next/image'
import Link from "next/link";
import React from "react";
import Footer from "@/components/Footer";
import NavBar from "@/components/NavBar";
import {Noto_Sans_Arabic} from "next/font/google";
const inter = Noto_Sans_Arabic({ subsets: ['arabic'] })
const AdvisoryCommittee = () => {
    const committeeMembers = [
        // Example data
        { name: "صحافي ومترجم وباحث وناقد سينمائي لبناني، ولد في العاصمة اللبنانية بيروت في عام 1946، عمل في مطلع حياته مساعد مخرج، كما شارك مع السيناريست الراحل عبدالحي أديب في كتابة عدد من نصوصه السينمائية، وعمل بمجال الصحافة منذ عام 1970 في صحف الدستور والبلاغ والسفير والحياة.حصل على جائزة الإنجاز الإبداعي من مهرجان الجونة السينمائي عام 2017 أعلن مركز السينما العربية عن تقديم جائزة الإنجاز النقدي لعام 2019 للبناني إبراهيم العريس لمسيرته الثرية في النقد السينمائي في العالم العربي.", imageUrl: "/commity_1.jpeg" },
        { name: "مصطفى سعيد مغني وعازف عود مصري، وباحث في الموسيقى العربية ومعلم لها، وهو من مواليد القاهرة عام 1983، التحق بمؤسسة بيت العود وتخرج ليصبح أستاذاً به في عام 2004، ثم أصبح مدرسًا بالمعهد العالي للموسيقى في الجامعة الأنطونية ببيروت في لبنان منذ عام 2006  \n" +
                "يهتم مصطفى بتوثيق التراث الموسيقي العربي، وبتطويره انطلاقًا من قواعده الأصيلة، فأسس في عام 2003 مجموعة «أصيل» للموسيقى العربية المعاصرة، كما أنه تولى منذ 2010 مسئولية إدارة مؤسّسة التوثيق والبحث في الموسيقى العربيّة  ", imageUrl: "/commity_2.jpeg" },
        { name: "شهد صالح العزاز مهندسة معمارية سعودية، مؤسس شركة \"شهد صالح العزاز للاستشارات الهندسية\".  \n" +
                "بدأت المهندسة شهد مسارها العملي كمتدربة لدى شركة رفايل دي لا هوز الأسبانية. وخلال فترة وجيزة ، إيمانًا بالقدرات التي أبرزتها، وبعزيمتها، قام المؤسس والشريك المدير لشركة رفايل دي لا هوز بتعيينها مديرة مشاريع الشرق الأوسط. أثناء عملها في العاصمة الاسبانية، مدريد، كانت المهندسة شهد مسؤولة عن مشاريع ضخمة متعددة في الشرق الأوسط وأوروبا. في عام ٢٠١٧، قررت أن تبدأ حكايتها الخاصة، حيث أسست شركتها للتصميم المعماري من قلب المملكة العربية السعودية، الرياض. تعتبر شهد وشركتها مسؤولة عن تصاميم عديدة حول العالم تتراوح بين المنازل الصغيرة والمباني الحكومية الضخمة ومتعددة الاستخدامات.  \n" +
                "\n" +
                "حصلت على شهادة البكالوريوس من جامعة مانشستر في بريطانيا حيث تخصصت في العمارة. والتحقت بعدها بجامعة الأسبانية التي صنفت من قبل مجلة التايمز ضمن أقوى عشر جامعات حول العالم للحصول على شهادة الماجستير بينما كانت تؤدي مهامها الوظيفية بالكامل.\n" +
                "وفي عام 2014 , نال مشروع شهد جائزة التميز و كرمتها الجامعة على أدائها المتفوق حيث نالت المرتبة الأولى ضمن خريجي الماجستير.", imageUrl: "/commity_3.jpeg" },
        { name: "كاتب وناقد مهتم بالادب والفنون.  شارك في  الاشراف على العديد من الانشطة الثقافية، كالترجمة و الاصدارات و ادارة مشروع انطولوجيا الادب والقصة السعودية.  صدر له كتاب نصوص ابداعية بعنوان \" التخلص من جثة\" عام ٢٠٠٠م. كما ترجم كتاب \"جذور الرومانتيكية\" 2012 للمفكر ايزايا برلين", imageUrl: "/commity_4.jpeg" },
        { name: "منيرة الصايغ هي قيمة فنية مستقلة، شغوفة بالثقافة تقيم في أبوظبي، في الإمارات العربية المتحدة.تسعى الصايغ بنشاط إلى ابتكار منصة ثقافية أصيلة، مما ساهم في تأسيس دروازة والتي تعّد أول منصة ثقافية من نوعها، وشريك استراتيجي لعدة مشاريع في أبوظبي. أسست الصايغ أيضاً Engage 101، وهي منصة تهتم بالاقتناء والبحوث. تعد الصايغ كاتبة في مجال الثقافة والفن، وهي أحد الأصوات المميزة في المنطقة التي تسلط الضوء من خلال نقاشاتها على أهمية التفكير غير المؤسسي لبناء حركات فنية إقليمية ناشئة.  \n" +
                "قامت الصايغ بتقييم وتطوير سلسلة برامج خاصة لمتحف جوجنهايم أبوظبي The Creative Act: Performance, Process, Presence (2017)، وفي عام 2014 ترأست مجموعة مبادرات التقييم الفني في آرت دبي حيث قامت بإدارة قسم المقيمين (2019) وبدأت سلسلة Now ، التي تبحث في المنصات الإبداعية الغير ممولة من قبل الحكومة في المنطقة. و عملت مؤخرا كمرشدة تعليمية وقيّمة فنية في كامبُس آرت دبي.\n" +
                "أقيم أول معرض فني من تقييمها الفردي تحت عنوان “بين” الذي يعد النسخة الثالثة لـ (أ.ع. م اللامحدودة). وقامت لاحقاً بتنسيق برنامج محادثات خاصة بفن أبوظبي. في عام 2020. أقامت الصايغ لأول مرة معرض “التأرجح: سياقات عبثية” بتكليف من معرض421 (مؤسسة الشيخة سلامة بنت حمدان) ، حيث قادت أيضًا مجموعة البرامج العامة التي أقيمت داخل المعرض.\n" +
                "ومن مشاريعها أيضاً، مشروع FIND التابع لجامعة نيويورك أبوظبي (2012)، وهي عضو في المجلس الاستشاري لمعرض الفنون بالجامعة. الصايغ هي جزء من لجنة الفنون البصرية بوزارة الثقافة الإماراتية وكذلك لجنة التوجيه والتقييم الفني بمجموعة “مقتنيات دبي“.\n", imageUrl: "/commity_5.png" },
        // Add more members as needed
    ];


    const renderTextWithLineBreaks = (text) => {
        return text.split('\n').map((line, index) => (
            <React.Fragment key={index} >
                {line}
                <br />
            </React.Fragment>
        ));
    };
    return (
        <div className={"bg-gold text-slate-900 "}>
            <NavBar/>
            <main className={`${inter.className} flex flex-col justify-center items-center min-h-screen p-8`}>

                <div className={"py-8"}>
                    <h1 className="text-4xl text-center text-black font-bold mb-8 mx-auto w-full">Advisory Committee</h1>
                    <div className="w-full flex flex-col items-center">
                        {committeeMembers.map((member, index) => (
                            <div key={index} className="flex flex-col  w-full lg:w-3/4 items-center mb-6 lg:mb-12 bg-white/30 rounded-3xl py-8">
                                <div className={"overflow-hidden h-[200px] lg:h-[300px] w-[200px] lg:w-[300px] lg:ml-4 relative"}>
                                    <Image src={member.imageUrl} alt={member.name} fill={true} className="rounded-full overflow-hidden object-cover" />
                                </div>
                                <div className="flex-1 text-right p-4" dir="rtl">
                                    <p className="text-lg">{renderTextWithLineBreaks(member.name)}</p>
                                </div>

                            </div>
                        ))}
                    </div>
                </div>
                <Footer />
            </main>
        </div>
    );

};

export default AdvisoryCommittee;
